---
type: StructuralConnectionApprovalType
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 4
tags: [revit-api, class]
---

# StructuralConnectionApprovalType

`Autodesk.Revit.DB.Structure.StructuralConnectionApprovalType` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2017 | `public static StructuralConnectionApprovalType Create ( Document doc , string name )` |
| Method | GetAllStructuralConnectionApprovalTypes | 2017 | `public static void GetAllStructuralConnectionApprovalTypes ( Document cda , out ICollection < ElementId > ids )` |
| Method | IsValidApprovalTypeName | 2017 | `public static bool IsValidApprovalTypeName ( Document doc , string name )` |
| Property | Parameter | — | `` |